{
  "exercises": [
    {
      "exercise_id": "ex_lunge_rotation_lead_leg",
      "canonical_name": "Lunge With Rotation Toward Lead Leg",
      "pt_category": "back_sij",
      "guidance": {
        "external_cues": [
          "Check that both feet point straight forward before each rep.",
          "Use a side support (chair/counter) as needed — holding firmly is allowed.",
          "Visually confirm the front knee tracks straight over the toes.",
          "Watch that your torso rotates toward the front leg during the descent.",
          "Check that your torso stays upright, not leaning forward or backward."
        ],
        "motor_cues": [
          "Move like an elevator — straight down, straight up.",
          "Rotate toward the lead leg as you go down, return to neutral as you come up.",
          "Push through the front heel to rise.",
          "Lightly tighten the front glute as you press up — this supports the SI joints.",
          "Keep pelvis level — imagine the hip bones as two headlights pointing forward."
        ],
        "compensation_warnings": [
          "If the back foot turns outward, reset — feet must remain forward.",
          "If the front knee collapses inward, reduce depth or rotation.",
          "If your torso tilts sideways, pause and re-establish the upright elevator line.",
          "If your pelvis drifts forward or backward instead of staying stacked, use more support."
        ],
        "safety_flags": [
          "Stop if you see your pelvis shift to one side during rotation — this is an early precursor to SI irritation.",
          "Stop if the back leg repeatedly tries to rotate outward despite correction.",
          "Stop if your support hand becomes weight-bearing instead of stabilizing.",
          "Stop if SI discomfort escalates within 3–5 reps."
        ]
      }
    },

    {
      "exercise_id": "ex_supine_hip_abduction_isometric",
      "canonical_name": "Supine Hip Abduction Isometric",
      "pt_category": "back_sij",
      "guidance": {
        "external_cues": [
          "Check that your legs are straight before starting.",
          "Rotate your feet inward first (toes slightly toward each other).",
          "Visually confirm your feet stay upward-facing and do not drift outward during the hold.",
          "Check that your legs begin hip-width apart before tightening the strap.",
          "Watch that you press evenly on both sides into the strap."
        ],
        "motor_cues": [
          "Press outward into the strap from the hips — the legs stay straight.",
          "Maintain a pelvic tilt (back flat, glutes relaxed) throughout the hold.",
          "Keep your heels aligned with your hips — imagine lengthening your legs toward your feet.",
          "Breathe steadily during the isometric; do not hold your breath."
        ],
        "compensation_warnings": [
          "If your feet rotate outward, pause and reset to the inward-start position.",
          "Avoid lifting or bending your legs; keep them long and straight.",
          "Avoid tensing your back muscles — outward pressure should come from the hips.",
          "Avoid shifting more pressure into one leg; keep the strap evenly loaded."
        ],
        "safety_flags": [
          "Stop if SI pressure develops within the first few seconds of the hold.",
          "Stop if outward pressure becomes uneven and you cannot correct it.",
          "Stop if your feet repeatedly rotate outward despite resetting.",
          "Stop if your back begins to tense or arch."
        ]
      }
    },

    {
      "exercise_id": "ex_seated_hip_hinge",
      "canonical_name": "Seated Hip Hinge",
      "pt_category": "back_sij",
      "guidance": {
        "external_cues": [
          "Check that both feet point straight forward before starting.",
          "Sit tall and visually confirm your torso is upright.",
          "Place fingertips lightly on ring 4 of the stability ball; keep pressure even.",
          "Watch the ball's inflation plug and hinge until it becomes vertically upright."
        ],
        "motor_cues": [
          "Hinge forward from your hips only; keep your spine neutral.",
          "Maintain a pelvic tilt (back flat).",
          "Keep your sit bones anchored to the chair — 'deep seat' cue.",
          "Return to upright by bringing your hips back under your torso, not by lifting your chest."
        ],
        "compensation_warnings": [
          "Do not let your glutes lift from the chair.",
          "Avoid rounding your lower back; if your ribs drop, pause and reset.",
          "Watch that your knees stay wide and do not collapse inward.",
          "If the ball tilts sideways or rolls unexpectedly, reduce hinge depth."
        ],
        "safety_flags": [
          "Stop if you see pelvic shifting left or right during the hinge.",
          "Stop if SI discomfort develops within several reps.",
          "Stop if one shoulder begins to dip lower than the other.",
          "Stop if your glutes tighten involuntarily and you cannot relax them."
        ]
      }
    },

    {
      "exercise_id": "ex_supine_9090_ball_squeeze_hip_ir",
      "canonical_name": "Supine 90/90 Ball Squeeze With Hip Internal Rotation",
      "pt_category": "back_sij",
      "guidance": {
        "external_cues": [
          "Ensure your hips and knees are in a 90/90 position with shins vertical.",
          "Place the small ball between your knees and keep your knees wide enough to hold it securely.",
          "Visually confirm that your feet point straight upward (vertical) at the start and throughout the movement.",
          "Maintain a pelvic tuck (back flat)."
        ],
        "motor_cues": [
          "Gently squeeze the ball between your knees.",
          "Keep your feet pointing straight upward and rotate your lower legs outward without letting the feet tilt or drop.",
          "Maintain the 90/90 shape — knees directly over hips, shins vertical.",
          "Keep the pelvic tuck through the entire movement."
        ],
        "compensation_warnings": [
          "Avoid letting your feet drop inward or outward — they should stay pointing upward.",
          "Avoid your knees drifting toward your chest; keep them stacked over your hips.",
          "Avoid lifting your lower legs; shins should remain vertical.",
          "Avoid arching your back or losing the pelvic tuck."
        ],
        "safety_flags": [
          "Stop if SI discomfort increases across reps.",
          "Stop if maintaining vertical feet requires increasing effort or causes loss of pelvic control."
        ]
      }
    },

{
  "exercise_id": "ex_sidelying_plank_knees_bent",
  "canonical_name": "Sidelying Plank (Knees Bent)",
  "pt_category": "back_sij",

  "guidance": {
    "external_cues": [
      "Begin in a straight line from head through hips and thighs, then bend your knees back to about 90 degrees without changing your torso or pelvic alignment.",
      "Use a foam pad or pillow under your elbow for comfort and stability.",
      "Place your elbow slightly inward before lifting; it will align under your shoulder once you are up.",
      "Keep your shoulders gently pulled back so the top shoulder does not roll forward.",
      "Look for a straight line from head through torso to hips to knees when lifted."
    ],

    "motor_cues": [
      "Tuck your pelvis (back flat) and tighten your core before lifting.",
      "Lift your hips upward while maintaining the straight-line shape from head through hips and thighs.",
      "Let your elbow stack under your shoulder once lifted; a small adjustment is normal.",
      "Lower with control, keeping alignment consistent."
    ],

    "compensation_warnings": [
      "Avoid twisting your torso; both shoulders should face forward the entire time.",
      "Avoid letting the top hip roll backward or forward.",
      "Avoid letting your lower knee slide forward or backward during the lift.",
      "Avoid collapsing through the shoulder; keep the shoulder aligned over the elbow once you are up."
    ],

    "safety_flags": [
      "Stop if your pelvis repeatedly drops and you cannot maintain alignment.",
      "Stop if your shoulder shifts forward over your elbow during the lift.",
      "Stop if SI discomfort increases during or after the set."
    ]
  }
}
  ]
}
