{
  "exercises": [
    {
      "exercise_id": "ex_lunge_rotation_lead_leg",
      "canonical_name": "Lunge With Rotation Toward Lead Leg",
      "pt_category": null,
      "guidance": {
        "external_cues": [
          "Check that both feet point straight forward before each rep.",
          "Use a side support (chair/counter) as needed — holding firmly is allowed.",
          "Visually confirm the front knee tracks straight over the toes.",
          "Watch that your torso rotates toward the front leg during the descent.",
          "Check that your torso stays upright, not leaning forward or backward."
        ],
        "motor_cues": [
          "Move like an elevator — straight down, straight up.",
          "Rotate toward the lead leg as you go down, return to neutral as you come up.",
          "Push through the front heel to rise.",
          "Lightly tighten the front glute as you press up — this supports the SI joints.",
          "Keep pelvis level — imagine the hip bones as two headlights pointing forward."
        ],
        "compensation_warnings": [
          "If the back foot turns outward, reset — feet must remain forward.",
          "If the front knee collapses inward, reduce depth or reduce rotation.",
          "If your torso tilts sideways, pause and re-establish the upright elevator line.",
          "If your pelvis drifts forward or backward instead of staying stacked, use more support."
        ],
        "safety_flags": [
          "Stop if you see your pelvis shift to one side during rotation — this is an early precursor to SI irritation.",
          "Stop if the back leg repeatedly tries to rotate outward despite correction.",
          "Stop if your support hand becomes weight-bearing instead of stabilizing.",
          "Stop if SI discomfort escalates within 3–5 reps."
        ]
      }
    },
    {
      "exercise_id": "ex_supine_hip_abduction_isometric",
      "canonical_name": "Supine Hip Abduction Isometric",
      "pt_category": null,
      "guidance": {
        "external_cues": [
          "Check that your legs are straight before starting.",
          "Rotate your feet inward first (toes slightly toward each other).",
          "Visually confirm your feet stay upward-facing and do not drift outward during the hold.",
          "Check that your legs begin hip-width apart before tightening the strap.",
          "Watch that you press evenly on both sides into the strap."
        ],
        "motor_cues": [
          "Press outward into the strap from the hips — the legs stay straight.",
          "Maintain a pelvic tilt (back flat, glutes relaxed) throughout the hold.",
          "Keep your heels aligned with your hips — imagine lengthening your legs toward your feet.",
          "Breathe steadily during the isometric; do not hold your breath."
        ],
        "compensation_warnings": [
          "If your feet rotate outward, pause and reset to the inward-start position.",
          "Avoid lifting or bending your legs; keep them long and straight.",
          "Avoid tensing your back muscles — outward pressure should come from the hips.",
          "Avoid shifting more pressure into one leg; keep the strap evenly loaded."
        ],
        "safety_flags": [
          "Stop if SI pressure develops within the first few seconds of the hold.",
          "Stop if outward pressure becomes uneven and you cannot correct it.",
          "Stop if your feet repeatedly rotate outward despite resetting.",
          "Stop if your back begins to tense or arch."
        ]
      }
    },

    /* PLACEHOLDERS — will be filled in next steps */

    {
      "exercise_id": "ex_seated_hip_hinge",
      "canonical_name": "Seated Hip Hinge",
      "pt_category": null,
      "guidance": {}
    },
    {
      "exercise_id": "ex_supine_9090_ball_squeeze_hip_ir",
      "canonical_name": "Supine 90/90 Ball Squeeze With Hip Internal Rotation",
      "pt_category": null,
      "guidance": {}
    },
    {
      "exercise_id": "ex_sidelying_plank_knees_bent",
      "canonical_name": "Sidelying Plank (Knees Bent)",
      "pt_category": null,
      "guidance": {}
    }
  ]
}