{
  "vocabulary_version": "1.0.0",
  "schema_ref": {
    "id": "exercise_roles.schema.json",
    "schema_version": "1.0"
  },
  "region": {
    "core": "Trunk region; deficits present as trunk force, control, or endurance limits.",
    "back": "Posterior trunk region; deficits present as spinal extensor force, control, or tolerance limits.",
    "hip": "Hip region; deficits present as hip force production or femoral control limits.",
    "knee": "Knee region; deficits present as knee force control or tolerance limits.",
    "ankle": "Ankle region; deficits present as distal control, force, or balance limits.",
    "foot": "Foot region; deficits present as intrinsic or toe-related control or force limits.",
    "shoulder": "Shoulder girdle; deficits present as scapular or glenohumeral control or force limits.",
    "vestibular": "Vestibular system contribution; deficits present as impaired gaze stability, balance integration, or motion tolerance."
  },
  "capacity": {
    "strength": "Ability to generate force. Failure looks like inability to hold, lift, or resist load.",
    "control": "Ability to maintain alignment while joints move. Failure looks like loss of alignment, sequencing, or timing.",
    "stability": "Ability to maintain position under asymmetry, perturbation, or unstable support. Failure looks like wobble, loss of balance, or giving way.",
    "tolerance": "Ability to sustain effort or posture over time. Failure looks like fatigue or symptom onset before form loss.",
    "mobility": "Ability to access and control available range of motion."
  },
  "contribution": {
    "high": "This exercise independently builds this capacity.",
    "medium": "This exercise meaningfully contributes but is not sufficient alone.",
    "low": "This exercise supports or touches this capacity."
  },
  "focus": {
    "sagittal": "Front/back spinal alignment (anti-extension / anti-flexion).",
    "lateral": "Side-to-side control.",
    "anti_rotation": "Resisting twist.",
    "dynamic": "Capacity expressed while limbs move.",
    "static": "Capacity expressed while holding still.",
    "eccentric": "Controlled lowering.",
    "great_toe": "Big toe specifically.",
    "intrinsics": "Foot intrinsic muscles."
  }
}
